#+TITLE: GP4IXM Data Analysis tools
#+OPTIONS: num:nil ^:nil
#+LaTeX_CLASS: normal
#+STARTUP: hideblocks
#+STYLE: <link rel="stylesheet"href="data/stylesheet.css"type="text/css">

*** rpn to alg
    :PROPERTIES:
    :CUSTOM_ID: rpn-to-alg
    :END:

evo individuals are check on the (0..9) range inclusive

#+results: rpn-string
| 4x51+x33x74+//x9x362/x/-x2/5/-x+*98+x3x-*3++5-3-x3x-*3**4++4- |

#+source: rpn-to-alg
#+begin_src ruby :var ind=rpn-string :results output
  operators = %W{+ - / *}
  $stack = []
  ind[0][0].split(//).each do |ch|
    if operators.include?(ch)
      right = $stack.pop or "1"
      left = $stack.pop or "1"
      $stack.push("(#{left} #{ch} #{right})")
    else
      $stack.push(ch)
    end
  end
  puts $stack.pop
#+end_src

#+results: rpn-to-alg
: (((x * (((3 - ((6 / 2) / x)) - ((x / 2) / 5)) + x)) + ((((((9 + 8) + ((x * (3 - x)) + 3)) - 5) - 3) * ((x * (3 - x)) * 3)) + 4)) - 4)

#+begin_src gnuplot :exports code
  set xrange[0:10]
  set xtics 0,1,10
  set yrange[-120:120]
  set grid
  plot 100 * sin(x), (((((((((2 * x) - 5) * (3 * ((((((x / ((x / ((2 * x) - 5)) * ((5 * x) / 5))) * x) * 6) - 3) * (x - (5 / 5))) / 5))) / 6) + 3) * x) / 6) + (((3 - x) * x) * 5)) * 8)
#+end_src

wider range

#+begin_src gnuplot :exports code
  set grid
  plot 100 * sin(x), ((((7 * (5 * ((((7 / x) - 3) + x) / (3 - x)))) / x) + x) * x)
#+end_src

